CodeSystem: TWCMFourDiagnosisCategory
Id: twcm-fourdiagnosis-category
Title: "中醫四診分類"
Description: "中醫門診單四診紀錄之分類，用於望診、聞診、問診、切診Observation之component.code，以區分各component所記錄的項目。"
* ^caseSensitive = true
* ^content = #complete
* ^experimental = false
* ^date = "2026-09-30"
* ^hierarchyMeaning = #grouped-by

* #"望診" "望診"
  * #"望神" "精神／意識／行為／情緒／性格(望神)"
  * #"望體" "體(望)"
  * #"望頭面" "頭面部(望)"
  * #"望目" "目部(望)"
  * #"望皮膚" "皮膚(望)"
* #"聞診" "聞診"
  * #"聞語音" "語音(聞)"
  * #"聞氣味" "氣味(聞)"
* #"問診" "問診"
  * #"問寒熱" "寒熱(問)"
  * #"問汗" "汗(問)"
  * #"問體" "體(問)"
  * #"問頭面" "頭面部(問)"
  * #"問目" "目部(問)"
  * #"問耳" "耳朵(問)"
  * #"問鼻咽" "鼻咽部(問)"
  * #"問飲食口味" "飲食／口味(問)"
  * #"問睡眠" "睡眠(問)"
  * #"問小便" "小便(問)"
  * #"問大便" "大便(問)"
  * #"問精神" "精神／意識／行為／情緒／性格(問)"
  * #"問婦女" "婦女相關(問)"
  * #"問男性" "男性相關(問)"
* #"切診" "切診"
  * #"按診" "按診(切)"
